import React from "react";
import "./Delivery.scss";
import PrivatIcon from "./../../assets/images/Icons/privat-bank.svg";
import CashIcon from "./../../assets/images/Icons/cash.svg";
import CashAftherDeliveryIcon from "./../../assets/images/Icons/cod.svg";
import MapIcon from "./../../assets/images/Icons/marker-map.svg";
import BusIcon from "./../../assets/images/Icons/bus.svg";
import CardIcon from "./../../assets/images/Icons/card.svg";
import { styled } from '@mui/material/styles';
import Box from '@mui/material/Box';
import Paper from '@mui/material/Paper';
import Grid from '@mui/material/Grid';
import Terminal from "./../../assets/images/Icons/payment-terminal2.webp";

const Item = styled(Paper)(({ theme }) => ({
  ...theme.typography.body2,
  padding: theme.spacing(1),
  textAlign: 'center',
  color: theme.palette.text.secondary,
}));

export function Delivery() {
  return <main className="delivery">
    <h1 className="delivery__title">
      Оплата та доставка
    </h1>
    <Box sx={{ flexGrow: 1, backgroundColor: "#EFF1F1"}} >
      <Grid container spacing={2}>
        <Grid item xs={6}>
          <Item>

            <h2 className="delivery__subTitle">
              ОПЛАТА
            </h2>
            <img src={CashIcon} alt="Cash icon"/>
            <h3 className="delivery__titleOfCategory">
              Готівкою
            </h3>
            <p>
              Оплата готівкою можлива тільки в Кієві, Харкові, Дніпрі, Львові та Одесі при покупці в магазині.
              На підтвердження оплати ми видаємо Вам товарний чек.
            </p>
            <img src={Terminal} style={{width: '50px'}} alt="Use Terminal"/>
            <h3 className="delivery__titleOfCategory">
              Оплата через термінал
            </h3>
            <p>
              Ви можете оплатити картою на місці за допомогою платіжного терміналу без обмежень по сумі.
              В даному випадку стягується комісія 3%.
            </p>
            <img src={CashAftherDeliveryIcon} alt="cash after delivery icon"/>
            <h3 className="delivery__titleOfCategory">
              Накладений платіж (оплата при отриманні)
            </h3>
            <p>
              Оплата готівкою при отриманні товару від кур'єра або в сервісі доставки «Нова пошта».
            </p>
            <p>
              Оплата здійснюється після перевірки складу посилки на відповідність замовленню і товарному
              чеку виключно в національній валюті. Звертаємо вашу увагу, що при отриманні посилки у
              відділенні компанії перевізника або у кур'єра і оплаті ви підписуєте акт прийому-передачі,
              яким підтверджуєте факт перевірки посилки на відповідність Вашому замовленню, а також
              погоджуєтеся з зовнішнім видом товару, його комплектацією і не маєте претензій до
              інтернет-магазину і компанії перевізнику.
            </p>
            <p>
              Післяплата передбачає передоплату від 200 грн.
            </p>
            <img src={PrivatIcon} alt="PrivatBank icon"/>
            <h3 className="delivery__titleOfCategory">
              На карту Приватбанка
            </h3>
            <p>
              При здійсненні переказу з карти на карту на суму до 1000 грн - комісія + 1%. Так само ви
              можете оплатити картою на місці за допомогою платіжного терміналу без обмежень по сумі. Комісія 3%.
            </p>
            <img src={CardIcon} alt="Card icon"/>
            <h3 className="delivery__titleOfCategory">
              Кредит в магазині
            </h3>
            <p>
              Всі покупки в Кактусі ви можете оформити в кредит прямо в магазині.
              Вибирайте зручну програму наших банків-партнерів і користуйтеся новим гаджетом вже сьогодні!
            </p>
            <p>
              При покупці в кредит вартість покупки збільшується на 5%
            </p>
            <img src={CardIcon} alt="Card icon"/>
            <h3 className="delivery__titleOfCategory">
              Кредит online
            </h3>
            <p>
              Всі покупки в Кактусі ви можете оформити в кредит або розстрочку не віходячи з дому.
              Вибирайте зручну програму наших банків-партнерів і користуйтеся новим гаджетом вже сьогодні!
            </p>
            <p>
              При покупці в кредит вартість покупки збільшується на 5%
            </p>
            <img src={CardIcon} alt="Card icon"/>
            <h3 className="delivery__titleOfCategory">
              LiqPay (оплата картою онлайн)
            </h3>
            <p>
              Оплата замовлення онлайн банківською картою Visa або MasterCard. Доставка товару можлива
              тільки після підтвердження платежу.
            </p>
            <p>
              Ви можете оплатити замовлення онлайн банківською картою Visa або MasterCard. Оплата за допомогою платіжних карт здійснюється наступним способом: під час оформлення замовлення на сайті, Вам буде запропоновано зробити вибір способу оплати. У графі "Оплата" вам потрібно вибрати «Оплата картою на сайті».
            </p>
          </Item>
        </Grid>
        <Grid item xs={6}>
          <Item>
            <h2 className="delivery__subTitle">
              ДОСТАВКА
            </h2>
            <img src={MapIcon} alt="map icon"/>
            <h3 className="delivery__titleOfCategory">
              Самовивіз з магазинів Розетка
            </h3>
            <p>
              Самовивіз з магазинів Cactus можливий в робочий час магазину.
            </p>
            <p>
              <b>м. Київ</b>
            </p>
            <p>
              вул. Пушкінська, 2-4/7, з 10:00 до 20:00 щодня
            </p>
            <p>
              <b>м. Харків</b>
            </p>
            <p>
              площа Павлівська, 8, з 10:00 до 21:00 щодня <br/>
              вул. Пушкінська, 31, з 10:00 до 21:00 щодня <br/>
              пр. Гагаріна, 181б, з 10:00 до 20:00 щодня <br/>
              вул. Сумська, 22, з 10:00 до 20:00 щодня <br/>
            </p>
            <p>
              <b>м. Дніпро</b>
            </p>
            <p>
              пр. Дмитра Яворницького, 46, з 10:00 до 20:00 щодня
            </p>
            <p>
              <b>м. Одеса</b>
            </p>
            <p>
              вул. Пушкінська, 74, з 10:00 до 20:00 щодня
            </p>
              <b>м. Львів</b>
            <p>
              вул. Коперника, 3, з 10:00 до 20:00 щодня
            </p>
            <img src={BusIcon} alt="bus icon"/>
            <h3 className="delivery__titleOfCategory">
              Експрес-доставка за 2 години (Харків)
            </h3>
            <p>
              Харків, зустрічай найшвидшу доставку в Кактусі - доставка за дві години!<br/><br/>
              Робите замовлення з 9:00 до 17:00, підтверджуєте його і займаєтеся своїми справами.
              А наш кур'єр доставить ваше замовлення за 2 години або раніше!<br/><br/>
              Замовлення кур'єр розвозить приблизно з 11:00 до 19:00 з понеділка по сб<br/><br/>
              Після 19:00 і в неділю так само є кур'єрська доставка, але по повній оплаті на карту.<br/><br/>
              Вартість такої доставки нижче, ніж в середньому у конкурентів - всього 200 грн.
              Погодьтеся, це зручно і вигідно. Особливо, коли замовлення вам потрібне прямо зараз!
              А якщо подумати, то і час витрачений на поїздку може обійтися значно дорожче.<br/><br/>
              Ви не зобов'язані попередньо оплачувати повну вартість покупки, досить сплатити вартість
              доставки 200 грн, решту суми за товар можна доплатити кур'єру готівкою.<br/><br/>
            </p>
            <h3 className="delivery__titleOfCategory">
              Доставка по місту: 200 грн
            </h3>
            <p>
              Кур'єр зобов'язаний тільки доставити товар і отримати оплату. Консультація і допомога в
              налаштуванні кур'єром не здійснюються. Щоб отримати консультацію, звертайтеся на гарячу
              лінію або пишіть в телеграм.
            </p>
            <p>
              Якщо одержувач не вийшов на зв'язок під час доставки товару, кур'єр не очікує і відправляється
              далі, гроші за доставку при цьому не повертаються.
            </p>
            <p>
              Скористайтеся послугою швидкої доставки вже зараз. Оформіть замовлення, виберіть у
              способах доставки виберіть «Експрес-доставка за 2 години (Харків)».
            </p>
            <p>
              Після отримання замовлення, наш менеджер зв'яжеться з вами і обумовить всі деталі.
            </p>
            <br/>
          </Item>
        </Grid>
      </Grid>
    </Box>
  </main>
}